//收藏列表，数据类型
export const COLLECT_DATA = [{
        id: 1,
        question: '介绍什么是类和对象，如何创建和使用它们。',
        answer: '1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111',
        created_time: '2023-10-11 11:11',
    },
    {
        id: 2,
        question: '介绍什么是类和对象，如何创建和使用它们。',
        answer: '222222',
        created_time: '2023-10-11 11:11',
    },
    {
        id: 3,
        question: '介绍什么是类和对象',
        answer: '333333',
        created_time: '2023-10-11 11:11',
    }
]

//用户登录信息数据类型
export const COUNT = {
    password: '111111',
    username: 'name',
}

//取消收藏位置类型
export const COLLECT_LOCATION = {
    QUESTION_LIST: 'system',   //问题列表
    MULT_CHAT: 'chat',  //多轮GPT
    ONE_CHAT: 'oneShot',  //单轮问答
}
